Dashboard/backend/app/Models/RoleModel.php

    public function addPermission($roleId, $permissionId)
    {
        $data = [
            'role_id' => $roleId,
            'permission_id' => $permissionId,
        ];

        return $this->db->table('role_permissions')->insert($data);
---
INSERT INTO `role_permissions` (`role_id`, `permission_id`) VALUES ('13', '2')

    public function getRolePermissions($roleId)
    {
        return $this->db->table('role_permissions rp')
                         ->join('permissions p','rp.permission_id=p.id')
                        ->where('role_id', $roleId)
                        ->select('p.id,p.name,p.gaurd_name')
                        ->get()
                        ->getResult();
---
SELECT `p`.`id`, `p`.`name`, `p`.`gaurd_name`
FROM `role_permissions` `rp`
JOIN `permissions` `p` ON `rp`.`permission_id`=`p`.`id`
WHERE `role_id` = '14'

    public function hasPermission($roleId, $permissionId)
    {
        return $this->db->table('role_permissions')
            ->where('role_id', $roleId)
            ->where('permission_id', $permissionId)
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `role_permissions`
WHERE `role_id` = '13'
AND `permission_id` = '2'

    public function deleteRelatedPermissions($data)
    {
        $roleId = $data['id'];

        // Delete related rows in role_permission
        $this->db->table('role_permissions')
            ->where('role_id', $roleId)
            ->delete();
---
DELETE FROM `role_permissions`
WHERE `role_id` = ('5')