Dashboard/backend/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'unifi'
 LIMIT 1
---
    public function login()
    {

        $data = $this->request->getJSON(true);
        $username = $data['username'];
        $password = $data['password'];
        $user = $this->userModel->where('username', $username)->first();