Dashboard/backend/app/Controllers/Carousel.php

    public function index(): ResponseInterface
    {
        if(!$this->checkPermission('_CarouselListComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);


        $carousels = $this->carouselModel->findAll();
---
SELECT *
FROM `carousels`

    public function show($id): ResponseInterface
    {
        if(!$this->checkPermission('_CarouselUpdateComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $carousel = $this->carouselModel->find($id);
---
SELECT *
FROM `carousels`
WHERE `carousels`.`id` = '4'

    public function create(): ResponseInterface
    {
        if(!$this->checkPermission('_CarouselAddComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

 // Load the upload library
 $upload = $this->request->getFile('img');

 // Check if the file is valid
 if ($upload->isValid() && !$upload->hasMoved())
 {

     // Set the file name and move it to the uploads directory
     $newName = $upload->getRandomName();

     $upload->move(ROOTPATH . 'public/uploads', $newName);

     // Perform additional actions if needed, e.g., store the file name in the database
$path=base_url('uploads/'. $newName);
 }

$data = $this->request->getPost();
$data['Img']=$path;

        if ($this->carouselModel->insert($data)) {
---
INSERT INTO `carousels` (`product_id`) VALUES ('14')