Dashboard/backend/app/Controllers/Categories.php

SELECT *
FROM `categories`
---
    public function index(): ResponseInterface
    {
        if(!$this->checkPermission('_CategoryListComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $categories = $this->categoryModel->findAll();