Dashboard/backend/app/Controllers/Permissions.php

SELECT *
FROM `permissions`
---
    public function index(): ResponseInterface
    {
        if(!$this->checkPermission('_PermissionListComponent'))
         return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $permissions = $this->permissionModel->findAll();

INSERT INTO `permissions` (`name`, `gaurd_name`) VALUES ('Add Category', 'category_add')
---
    public function create(): ResponseInterface
    {
        if(!$this->checkPermission('_PermissionAddComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $data = $this->request->getJSON(true);

        if ($this->permissionModel->insert($data)) {