Dashboard/backend/app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function index(): ResponseInterface
    {
        if(!$this->checkPermission('_ProductListComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);


        $products = $this->productModel->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '12'
---
    public function show($id): ResponseInterface
    {
        if(!$this->checkPermission('_ProductUpdateComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $product = $this->productModel->find($id);

SELECT *
FROM `products`
WHERE `products`.`id` = '14'
DELETE FROM `carousels`
WHERE `product_id` = '14'
DELETE FROM `products`
WHERE `id` IN ('14')
---
    public function delete($id): ResponseInterface
    {
        $product = $this->productModel->find($id);

        if ($product) {
            // Delete carousels associated with the post
            $this->carouselModel->where('product_id',$id)->delete();

            // Delete the post itself
            $this->productModel->delete($id);