Dashboard/backend/app/Controllers/Roles.php

    public function index(): ResponseInterface
    {
        if(!$this->checkPermission('_RoleListComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $roles = $this->roleModel->findAll();
---
SELECT *
FROM `roles`

    public function show($id): ResponseInterface
    {
        if(!$this->checkPermission('_RoleUpdateComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $role = $this->roleModel->find($id);
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = '13'

    public function update($id): ResponseInterface
    {
        if(!$this->checkPermission('_RoleUpdateComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $data = $this->request->getJSON(true);

        if ($this->roleModel->update($id, $data)) {
            $data_id["id"]=$id;
            $this->roleModel->deleteRelatedPermissions($data_id);
---
UPDATE `roles` SET `name` = 'vsvs'
WHERE `roles`.`id` IN ('13')
DELETE FROM `roles`
WHERE `id` IN ('5')