Dashboard/backend/app/Controllers/Users.php

SELECT `users`.*, `roles`.`name` as `role`
FROM `users`
JOIN `roles` ON `roles`.`id`=`users`.`role_id`
---
    public function index(): ResponseInterface
    {
        if(!$this->checkPermission('_AdminListComponent'))
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(401);

        $users = $this->userModel->join('roles','roles.id=users.role_id')->select('users.*,roles.name as role')->findAll();